final-ec2-benchmarks/ec2.m3.2xl.1.uniform85.1/70/ycsb-results
java -cp postgresql-9.4.1212.jre7.jar:/home/ubuntu/ycsb/jdbc-binding/conf:/home/ubuntu/ycsb/conf:/home/ubuntu/ycsb/lib/jdbc-binding-0.13.0-SNAPSHOT.jar:/home/ubuntu/ycsb/lib/core-0.13.0-SNAPSHOT.jar:/home/ubuntu/ycsb/lib/openjpa-jdbc-2.1.1.jar:/home/ubuntu/ycsb/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb/lib/geronimo-jta_1.1_spec-1.1.1.jar:/home/ubuntu/ycsb/lib/commons-collections-3.2.1.jar:/home/ubuntu/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb/lib/geronimo-jms_1.1_spec-1.1.1.jar:/home/ubuntu/ycsb/lib/serp-1.13.1.jar:/home/ubuntu/ycsb/lib/openjpa-kernel-2.1.1.jar:/home/ubuntu/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/openjpa-lib-2.1.1.jar:/home/ubuntu/ycsb/lib/commons-lang-2.4.jar:/home/ubuntu/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb/lib/commons-pool-1.5.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P workloads/uniform85 -P cockroachdb.properties -p db.url=jdbc:postgresql://52.40.121.25:26267/test,jdbc:postgresql://52.42.192.88:26267/test,jdbc:postgresql://52.35.124.172:26267/test,jdbc:postgresql://52.42.176.201:26267/test,jdbc:postgresql://52.40.92.79:26267/test -s -threads 70 -t
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P workloads/uniform85 -P cockroachdb.properties -p db.url=jdbc:postgresql://52.40.121.25:26267/test,jdbc:postgresql://52.42.192.88:26267/test,jdbc:postgresql://52.35.124.172:26267/test,jdbc:postgresql://52.42.176.201:26267/test,jdbc:postgresql://52.40.92.79:26267/test -s -threads 70 -tYCSB Client 0.13.0-SNAPSHOT

Loading workload...
Starting test.
2017-03-12 02:21:13:695 0 sec: 0 operations; est completion in 0 seconds 
Adding shard node URL: jdbc:postgresql://52.40.121.25:26267/test
Adding shard node URL: jdbc:postgresql://52.40.121.25:26267/test
Adding shard node URL: jdbc:postgresql://52.40.121.25:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
Adding shard node URL: jdbc:postgresql://52.42.192.88:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
[...]
Using shards: 5, batchSize:-1, fetchSize: -1
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/testDBWrapper: report latency for each error is false and specific error codes to track for latency are: []

Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test

Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.35.124.172:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
[...]
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
[...]
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1

Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.42.176.201:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
[...]
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Adding shard node URL: jdbc:postgresql://52.40.92.79:26267/test
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1DBWrapper: report latency for each error is false and specific error codes to track for latency are: []

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []Using shards: 5, batchSize:-1, fetchSize: -1

DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
Using shards: 5, batchSize:-1, fetchSize: -1
Using shards: 5, batchSize:-1, fetchSize: -1
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2017-03-12 02:21:21:620 7 sec: 100000 operations; 12551.78 current ops/sec; [READ: Count=84890, Max=34655, Min=868, Avg=1856.74, 90=2965, 99=11151, 99.9=19391, 99.99=30495] [CLEANUP: Count=70, Max=423, Min=87, Avg=118.79, 90=155, 99=262, 99.9=423, 99.99=423] [UPDATE: Count=15110, Max=76735, Min=2058, Avg=23832.89, 90=39519, 99=53791, 99.9=64063, 99.99=69759] 
[OVERALL], RunTime(ms), 7966.0
[OVERALL], Throughput(ops/sec), 12553.351744915892
[TOTAL_GCS_PS_Scavenge], Count, 2.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 13.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1631935726839066
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 2.0
[TOTAL_GC_TIME], Time(ms), 13.0
[TOTAL_GC_TIME_%], Time(%), 0.1631935726839066
[READ], Operations, 84890.0
[READ], AverageLatency(us), 1856.7406643892095
[READ], MinLatency(us), 868.0
[READ], MaxLatency(us), 34655.0
[READ], 95thPercentileLatency(us), 5427.0
[READ], 99thPercentileLatency(us), 11151.0
[READ], Return=OK, 84890
[CLEANUP], Operations, 70.0
[CLEANUP], AverageLatency(us), 118.78571428571429
[CLEANUP], MinLatency(us), 87.0
[CLEANUP], MaxLatency(us), 423.0
[CLEANUP], 95thPercentileLatency(us), 199.0
[CLEANUP], 99thPercentileLatency(us), 262.0
[UPDATE], Operations, 15110.0
[UPDATE], AverageLatency(us), 23832.88544010589
[UPDATE], MinLatency(us), 2058.0
[UPDATE], MaxLatency(us), 76735.0
[UPDATE], 95thPercentileLatency(us), 44607.0
[UPDATE], 99thPercentileLatency(us), 53791.0
[UPDATE], Return=OK, 15110